{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi", "How are you", "Is anyone there?", "Hello", "Good day", "Whats up", "Hey", "greetings", "Hola", "Hello there", "Howdy", "What's new?", "Hi there", "Good to see you", "What's happening?", "How's it going?", "Nice to meet you", "Good morning", "Good afternoon", "Good evening", "Pleased to meet you", "It's nice to see you", "Long time no see", "What's going on?", "How's everything?", "What's up?", "How's life?", "How's your day?", "Hiya", "How's it going?", "Hey there", "What's good?", "How have you been?", "Hey!", "Yo!", "Hi, how's your day going?", "How's everything going?", "Are you alright?", "How's everything with you?", "Hey, what's happening?", "Yo, what's up?", "Hey, how are you doing?", "Hi, what's new?", "Hello, any news?", "Hey, what's going on?", "Hello, how's everything?", "Hi, how's life treating you?", "Hello, how's your day going?", "Hey, how's the day treating you?", "Hi, what's the good word?", "What's shaking?", "How's the world treating you?", "What's crackin'?", "What's cooking?", "How's it hanging?", "What's kickin'?", "How's the world spinning?"
        ],
        "responses": [
          "Hello!", "Good to see you again!", "Hi there, how can I help?", "Hello there! How can I assist you today?", "Greetings! How can I help you?", "Hi! How can I assist you?", "Good to see you! How can I help you today?", "Hello! What can I do for you today?", "Hey! How may I assist you?", "Hello, how may I assist you today?", "Hi, what can I do for you?", "Good day! How can I assist you?", "Hello, what can I help you with today?", "Hi there! What can I do for you today?", "Hello! How can I assist you?", "Hi, how may I help you?", "Good to see you! What can I assist you with today?", "Hello, what can I do for you today?", "Hey, how can I assist you today?", "Hello! What can I assist you with?", "Hi, what can I help you with?", "Good day, how can I assist you?", "Hi there! How may I assist you today?", "Hello! How can I help you today?", "Hey there! What's up?", "Hello! Good to see you!", "Hi there! Anything new?", "Hey! How's everything going?", "Hello! Anything you need assistance with?", "Hi! How's your day going?", "Hello, nice to see you again!", "Hey there! How's life?", "Hi there, what's happening?", "Hello, anything I can assist with?", "Hey, good to see you!"
        ],
        "context_set": ""
      },
      {
        "tag": "goodbye",
        "patterns": [
          "cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day", "bye", "I have to go", "I'm off", "Talk to you later", "I need to get going", "I'll catch you later", "Until next time", "Farewell", "Catch you later", "I have to head out", "I'm heading out", "Time for me to go", "I need to leave", "See ya", "I'll see you later", "See you soon", "Bye for now", "Talk to you soon", "Until we meet again", "I must go", "Goodbye for now", "It's time for me to leave", "I'll talk to you later", "I'm out", "Later", "I'll see you next time"
        ],
        "responses": [
          "Sad to see you go :(", "Talk to you later", "Goodbye!", "See you next time", "Take care", "Have a great day", "See you soon", "Until next time", "Farewell!", "Catch you later", "Safe travels", "Have a good one", "Goodbye for now", "Looking forward to our next chat", "Have a nice day", "See you later", "Bye for now", "All the best", "Goodbye and take care", "Take it easy", "See ya", "Until we meet again", "Hope to see you again soon", "Bye, take care", "Take care, bye", "It was nice talking to you"
        ],
        "context_set": ""
      },
      {
        "tag": "technology",
        "patterns": [
          "What is technology?", "Can you explain what AI is?", "What's the latest in tech?", "Tell me about machine learning", "What's the difference between AI and machine learning?", "I want to learn about programming", "What is the internet?", "What is data science?", "Can you explain blockchain?", "What is IoT?", "Can you explain how computers work?", "What's the role of technology in our lives?", "What's a neural network?", "What is quantum computing?", "Can you tell me about cloud computing?", "What is augmented reality?", "What is virtual reality?", "What are the benefits of technology?", "Tell me about cyber security", "What is the role of technology in education?", "What is the impact of technology on society?", "What are the downsides of technology?", "What is Big Data?", "What are robotics?", "Can you explain the concept of digital transformation?", "What is 5G?", "Tell me about the future of technology", "What is information technology?", "What is biotechnology?", "Can you explain nanotechnology?", "What are the advancements in medical technology?", "What is a cryptocurrency?", "What is a smart home?", "What is automation?"
        ],
        "responses": [
          "Technology refers to the application of scientific knowledge for practical purposes, especially in industry.", "Artificial intelligence (AI) refers to the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions.", "Machine learning is a type of AI where computers can learn and make decisions without being explicitly programmed.", "The Internet is a global network of interconnected computers that use the standard Internet protocol suite (TCP/IP) to link billions of devices worldwide.", "Data science is a multi-disciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from structured and unstructured data.", "Blockchain is a system of recording information in a way that makes it difficult or impossible to change, hack, or cheat the system.", "The Internet of Things (IoT) refers to the network of physical devices, vehicles, appliances, and other items embedded with electronics, software, sensors, and connectivity which enables these objects to connect and exchange data.", "Computers work by taking input from a user, processing that input in some way and then producing output.", "A neural network is a series of algorithms that attempts to identify underlying relationships in a set of data through a process that mimics the way the human brain operates.", "Quantum computing is an area of computing focused on developing computer-based technologies centered around the principles of quantum theory.", "Cloud computing is the delivery of computing services including servers, storage, databases, networking, software, analytics, and intelligence over the Internet to offer faster innovation, flexible resources, and economies of scale.", "Augmented reality (AR) is an interactive experience of a real-world environment where the objects that reside in the real world are enhanced by computer-generated perceptual information.", "Virtual reality (VR) is a simulated experience that can be similar to or completely different from the real world.", "Cyber security is the practice of protecting systems, networks, and programs from digital attacks.", "Big Data refers to extremely large data sets that may be analysed computationally to reveal patterns, trends, and associations, especially relating to human behaviour and interactions.", "Robotics is the branch of technology that deals with the design, construction, operation, and application of robots.", "5G is the 5th generation mobile network, designed to connect virtually everyone and everything together including machines, objects, and devices.", "Information technology (IT) is the use of computers to store, retrieve, transmit, and manipulate data or information.", "Biotechnology is a broad area of biology, involving the use of living systems and organisms to develop or make products.", "Nanotechnology is the manipulation of matter on an atomic, molecular, and supramolecular scale.", "A cryptocurrency is a digital or virtual currency that uses cryptography for security.", "A smart home is a convenient home setup where appliances and devices can be automatically controlled remotely from anywhere with an internet connection using a mobile or other networked device.", "Automation is the technology by which a process or procedure is performed with minimal human assistance."
        ],
        "context_set": ""
      },
      {
        "tag": "politics",
        "patterns": [
          "Tell me about politics", "What is politics?", "Who is the current president?", "What's the latest political news?", "What is democracy?", "What do you know about politics?", "Can you explain politics to me?", "Who is the current Prime Minister?", "What is the role of the president?", "How does voting work?", "What are the main political parties?", "What is a republic?", "What is a constitution?", "What is government?", "What does a senator do?", "What's the difference between a president and a prime minister?", "Who is the leader of the party?", "Can you tell me more about politics?", "What is an election?", "What does a mayor do?", "What is politics in simple terms?", "What are the political news today?", "What are the branches of government?", "What is a monarchy?", "What is a parliament?"
        ],
        "responses": [
          "Politics is the way that people living in groups make decisions. It refers to achieving and exercising positions of governance—organized control over a human community, particularly a state.", "The current president or Prime Minister might change over time, I suggest checking a reliable news source for the most accurate information.", "I'm sorry, I can't provide real-time information or news updates.", "Democracy is a system of government where the citizens exercise power by voting.", "There are many political parties and their prominence can vary by country. Typically, they represent different political ideologies and policies.", "A constitution is a set of fundamental principles or established precedents according to which a state or other organization is governed.", "An election is a formal group decision-making process by which a population chooses an individual or multiple individuals to hold public office.", "A senator is a member of a senate, which is a type of deliberative assembly.", "The role of a president or prime minister can vary significantly in different countries, typically they are the head of government and execute political policies and state administration.", "The branches of government typically include the executive, legislative, and judiciary. They have different roles and responsibilities to ensure a balance of power."
        ],
        "context_set": ""
      },
      {
        "tag": "nature",
        "patterns": [
          "Tell me about nature", "What is nature?", "Why is nature important?", "Can you describe nature?", "What do you know about the environment?", "I want to learn about ecosystems", "Can you explain biodiversity?", "What's the role of nature?", "What is the importance of nature conservation?", "Can you talk about climate change?", "What is global warming?", "Tell me about deforestation", "How can we protect nature?", "I'm interested in learning about nature", "What is ecology?", "Tell me about the environment", "What's the deal with pollution?", "Explain environmental conservation", "I want to learn about natural resources", "Tell me about renewable energy", "What's the role of nature in our lives?", "What is the impact of human activity on nature?", "How can we reduce pollution?", "Tell me about sustainability", "What is the balance of nature?", "I'm interested in natural sciences", "Tell me about the flora and fauna"
        ],
        "responses": [
          "Nature refers to the natural world, including plants, animals, the landscape, and other features and products of the earth.", "Nature is all the animals, plants, and other things in the world that are not made by people.", "The importance of nature lies in its role in providing air, water, food and other survival needs for all living beings.", "We can protect nature by using resources responsibly, reducing waste and pollution, and promoting conservation efforts.", "Climate change is a long-term change in the average weather patterns that define the earth's local, regional and global climates.", "Deforestation is the action of clearing a wide area of trees.", "Biodiversity refers to the variety of life on earth, in all its forms and interactions.", "Ecology is the branch of biology which studies the interactions among organisms and their environment.", "Environmental conservation is about protecting our ecosystem and environment.", "Human activities can have a detrimental impact on nature, leading to pollution, deforestation, and loss of biodiversity.", "Sustainability is a way of living that aims to reduce the use of the Earth's natural resources."
        ],
        "context_set": ""
      },
      {
        "tag": "weather",
        "patterns": ["How is the weather today?", "What's the weather like?", "Is it going to rain today?", "What is the forecast for today?", "Should I take an umbrella today?"],
        "responses": ["I am sorry, I don't have the ability to check the weather as it requires real-time information. Please check a reliable weather service."],
        "context_set": ""
      },
      {
        "tag": "jokes",
        "patterns": [
          "Tell me a joke", "Do you know any jokes?", "Make me laugh", "I need something funny", "Know any good jokes?", "Hit me with a joke", "I could use a laugh", "Have any jokes to share?", "Tell me something funny", "Cheer me up with a joke", "I'm in need of a good laugh", "Give me your best joke", "I need to hear a joke", "Can you tell a joke?", "What's a good joke?", "Tell me your best joke", "Got any funny jokes?", "I could use a good joke", "Know any jokes?", "Let's hear a joke", "Do you know a funny joke?", "Tell a joke", "Share a joke", "What's your best joke?", "Do you have a joke for me?", "Give me a joke", "I want to hear a joke", "Share a funny joke", "Can you share a joke?"
        ],
        "responses": [
          "Why don't scientists trust atoms? Because they make up everything!", "Why was the math book sad? Because it had too many problems!", "Why don't some fish play piano? Because you can't tuna fish!", "What do you call fake spaghetti? An impasta!", "Why don't we write secrets in a computer? Because it has too many bytes!", "Why was the computer cold? It left its Windows open!", "Why did the golfer bring two pairs of pants? In case he got a hole in one!", "What do you call a snowman with a six-pack? An abdominal snowman!", "Why did the scarecrow win an award? Because he was outstanding in his field!", "What do you call a fish without eyes? Fsh!", "Why can't a bicycle stand up by itself? Because it's two-tired!", "Why was the belt arrested? Because it was holding up a pair of pants!", "How do you organize a space party? You planet!", "Why did the tomato turn red? Because it saw the salad dressing!", "Why don't skeletons fight each other? They don't have the guts!", "Why did the picture go to jail? Because it was framed!", "Why do we tell actors to 'break a leg'? Because every play has a cast!"
        ],
        "context_set": ""
      }     
    ]
  }